{"id":257190,"xmlId":"org.antlr.intellij.plugin","name":"ANTLR v4","description":"<p>\n      This plugin is for ANTLR v4 grammars and includes ANTLR 4.11.1. It works with\n      2020.2.1 and above.  It should work in other JetBrains IDEs.\n     </p>\n\n     <ul>\n     <li> syntax highlighting\n     </li><li> syntax error checking\n     </li><li> semantic error checking\n     </li><li> navigation window\n     </li><li> goto-declaration\n     </li><li> find usages\n     </li><li> rename tokens\n     </li><li> rename rules\n     </li><li> comment grammar rule lines with meta-/ (1.7)\n     </li><li> save parse trees as svg/jpg/png; right click in parse tree view (1.9)\n     </li><li> grammar/comment folding (1.7)\n     </li><li> generates parser code; shortcut (ctrl-shift-G / meta-shift-G) but it's in Tools menu and popups.\n     </li><li> code completion for tokens, rule names;\n     </li><li> finds tokenVocab option for code gen if there is a tokenVocab option, don't warn about implicit tokens.\n     </li><li> handles separate parsers and lexers like TParser.g4 and TLexer.g4 (1.7)\n     </li><li> parse tree nodes show the alternative number the parser chose to match that node. (1.7)\n     </li><li> has live grammar interpreter for grammar preview. Right click on rule and say \"Test ANTLR Rule\". <b>Please noteThat actions and semantic predicates in the grammar or not executed during this preview!</b>\n     </li><li> view parse trees in hierarchy (sideways tree) view. (1.8)\n     </li><li> can view parse trees for input matched in more than one way (ambiguities) (1.7)\n     </li><li> can view lookahead trees to show how input directed ANTLR to match a particular alternative (1.7)\n\t</li><li> changes to grammar seen in parse tree upon save of grammar.\n\t</li><li> works with all JetBrains IDEs (1.8)\n\t</li><li> refactoring: extract rule, inline rule (1.8), dup rule to make refs unique\n     </li></ul>\n\n      <p>Generates code in /gen/package/YourGrammarRecognizer.java\n      unless you override in the configuration dialog.\n      Shortcut to generate parsers is ctrl-shift-G / meta-shift-G but it's in Tools menu, popups.\n\n      Code completion for tokens, rule names. finds tokenVocab option for code gen\n          if there is a tokenVocab option, don't warn about implicit tokens.\n          shortcut conflicted with grammar-kit plugin. Has live grammar interpreter\n          for grammar preview. Right click on rule and say \"Test ANTLR Rule\".\n          Changes to grammar seen in parse tree upon save of grammar.\n  </p><p>\n          You can configure the ANTLR tool options per grammar file; right-click\n          in a grammar or on a grammar element within the structured view.\n          When you change and save a grammar, it automatically builds with ANTLR\n          in the background according to the preferences you have set.  ANTLR\n          tool errors appear in a console you can opened by clicking on a button\n          in the bottom tab.\n  </p><p>\n          You can use the ctrl-key while moving the mouse and it will show you\n          token information in the preview editor box via tooltips.\n\n  </p><p>\n          Errors within the preview editor are now highlighted with tooltips\n          and underlining just like a regular editor window. The difference\n          is that this window's grammar is specified in your grammar file.\n\n</p><p>See <a href=\"https://github.com/antlr/intellij-plugin-v4/blob/master/README.md\">README.md</a>\nfor more details.\n\n</p><p>\nFor really big files and slow grammars, there is an appreciable delay when displaying the parse tree or profiling information.\n\n</p><p>\n<a href=\"https://github.com/antlr/intellij-plugin-v4\">Github source</a></p>","tags":["Tools Integration"],"vendor":"ANTLR Project","version":"1.19.3-3","notes":"<ul>\n\t    <li>ANTLR bumped from 4.10.1 to 4.11.1</li>\n\t    <li>A number of bug fixes</li>\n    </ul>\n\t See the complete list of <a href=\"https://github.com/antlr/intellij-plugin-v4/issues?q=milestone%3A1.19.3+is%3Aclosed\">fixed issues</a>.","dependencies":["com.intellij.modules.lang"],"since":"203.0","size":3585738,"sourceCodeUrl":"https://github.com/antlr/intellij-plugin-v4"}